Standalone/soap/GetLogFile.xml

<?xml version="1.0" encoding="UTF-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Header>
    <sapsess:Session xmlns:sapsess="http://www.sap.com/webas/630/soap/features/session/">
        <enableSession>true</enableSession>
    </sapsess:Session>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
    <ns1:ReadLogFile xmlns:ns1="urn:SAPControl">
<!-- filename are retreive in ListLogFile.xml -->
        <filename>work/dev_w0</filename>
        <filter></filter>
        <language></language>
        <maxentries>100</maxentries>
        <statecookie>EOF</statecookie>
    </ns1:ReadLogFile>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
